src/config/InformationRegisters/а_СвязьОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>а_СвязьОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыРазгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.а_ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Enums/а_ТипыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>а_ТипыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПунктРазгрузки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/InformationRegisters/а_СвязьОбъектов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПунктРазгрузки(СтрИД) Экспорт
	
	СтрИД = Лев(СтрИД, 50);
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИД", СтрИД);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	а_СвязьОбъектов.Объект КАК Объект
	               |ИЗ
	               |	РегистрСведений.а_СвязьОбъектов КАК а_СвязьОбъектов
	               |ГДЕ
	               |	а_СвязьОбъектов.ИД = &ИД
	               |	И а_СвязьОбъектов.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.а_ТипыОбъектов.ПунктРазгрузки)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Объект;
	КонецЕсли;
	
	Возврат Неопределено;
		
КонецФункции
	
#КонецЕсли
